# Brewfile - Herramientas CLI
# Instalación: brew bundle install

# Taps
tap "oven-sh/bun"
tap "homebrew/cask-fonts"

# ============================================================================
# CLI Tools - Solo las herramientas que uso
# ============================================================================

brew "bun"
brew "fnm"
brew "pyenv"
brew "xz"
brew "git-lfs"
brew "fastfetch"
brew "gh"
brew "mailhog"
brew "vercel-cli"
brew "imagemagick"
brew "ffmpeg"
brew "go"
brew "r"
brew "pipx"

# ============================================================================
# Applications (Casks)
# ============================================================================

cask "dotnet-sdk"

# Fuentes
cask "font-meslo-lg-nerd-font"
cask "font-cascadia-code-pl"
cask "font-fira-code-nerd-font"
