# Brewfile - Herramientas CLI
# Instalación: brew bundle install

# Taps
tap "oven-sh/bun"

# ============================================================================
# CLI Tools - Solo las herramientas que uso
# ============================================================================

brew "bun"
brew "fnm"
brew "pyenv"
brew "xz"
brew "git-lfs"
brew "fastfetch"
brew "gh"
brew "go"
brew "r"
brew "pipx"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "ripgrep"
brew "sd"
brew "fd"

# ============================================================================
# Applications (Casks)
# ============================================================================

cask "dotnet-sdk"

# Fuentes
cask "font-meslo-lg-nerd-font"
cask "font-cascadia-code-pl"
cask "font-fira-code-nerd-font"
