# Brewfile - Herramientas CLI
# Instalación: brew bundle install

# Taps
tap "oven-sh/bun"
tap "gentleman-programming/tap"

# ============================================================================
# CLI Tools - Solo las herramientas que uso
# ============================================================================

brew "bun"
brew "pyenv"
brew "xz"
brew "git-lfs"
brew "fastfetch"
brew "gh"
brew "pipx"
brew "actionlint"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "ripgrep"
brew "sd"
brew "fd"
brew "uv"
brew "mole"
brew "btop"
brew "engram"

# ============================================================================
# Applications (Casks)
# ============================================================================

cask "dotnet-sdk"

# Fuentes
cask "font-meslo-lg-nerd-font"
cask "font-cascadia-code-pl"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
